In [5]:
import pandas as pd

In [25]:
dados = [['Alameda, 1292, Sala 591 - Apto 591',2,3],[4,5,6],[7,8,9]]
df = pd.DataFrame(dados,
                  index=['lin1','lin2','lin3'],
                  columns=['col1','col2','col3'])
df

                                    col1  col2  col3
lin1  Alameda, 1292, Sala 591 - Apto 591     2     3
lin2                                   4     5     6
lin3                                   7     8     9

In [24]:
#1ª forma
df['col2']['lin2']
s=str(df['col2']['lin2'])
#df.at['lin2','col2'] = s
#type(df['col2']['lin2'])
#s=str(df['col2']['lin2'])
dividido = s.split(',')
dividido[0]
df.at['lin2', 'col2']= dividido[0]
df

      col1     col2  col3
lin1     1        2     3
lin2     4  Alameda     6
lin3     7        8     9

In [23]:
#2ª forma
df.at['lin2', 'col2']

'Alameda, 5, Agora'

In [7]:
#2ª forma + substituir valor
df.at['lin2', 'col2']= 6

In [8]:
df

      col1  col2  col3
lin1     1     2     3
lin2     4     6     6
lin3     7     8     9

In [14]:
#3ª forma
df.iat[2,1]

8